package Module_4_Collections_and_Map.HW;

import java.io.File;
import java.io.FileNotFoundException;
import java.io.PrintWriter;

/**
 * Created by Roman on 10.12.2015.
 */
//1.Написать программу переводчик, которая будет переводить текст, написанный на одном языке, на другой язык согласно заранее составленному словарю.
//2.* Сделать ф-ю ручного наполнения словаря, ввода слов и возможность его сохранения на диск (например в файл *.txt).
//3.** Сделать функцию чтения из файла слов в словарь.
// Слова сделать в Mape
public class HW1 {

}
