package Module_2_OOP.Lesson5.HW;

/**
 * Created by Roman on 29.11.2015.
 */
//Создать список услуг (меню, товара …) со стоимостью. Например: Кола –10грн.; Кола и бургер–30 грн. …

public class Main_Cafe {
    public static void main(String[] args) {

        System.out.println("Стоимость колы: " +Menu.cola);
        Menu.getColaBurger();
        System.out.println("Стоимость кола+бургер: " + Menu.cola);





    }
}
