package Module_1_Basic.Lesson1_Hello;

/**
 * Created by Roman on 05.11.2015.
 */
public class Zadanie1 {

    public static void main(String[] args) {

        //Вывести текст в таком же виде как написано используя 3 раза print и 5 раз println:

        System.out.print("Я ");
        System.out.print("начал ");
        System.out.print("изучать Java. ");
        System.out.println("Пока только написали");
        System.out.println("команду Hello world, но вскоре");
        System.out.println("начнем целочисленные переменне");
        System.out.println("и");
        System.out.println("циклы! Ура!");

    }
}
