package Module_2_OOP.Lesson1_NewMethod.HomeWork_2311;

/**
 * Created by Roman on 23.11.2015.
 */
public class HW2 {
    public static void main(String[] args) {
        //Написать метод который считает расход бензина 2-х автомобилей,учитывая расстояние,
        // скорость (при скорости до 85 км/час –коефрасхода 1.1, 86-95 –1.0, больше 96 –1.2) и объем двигателя.
        // Автомобиль движется 15км со скорость 65,
        // потом скорость увеличивается на 20км/час и так автомобиль едет еще 25 минут,
        // после чего подымает скорость еще на 30 км/час и проезжает 15 км.,
        // после чего каждые 5 минут сбрасывает скорость на 10 км/час до нуля.
    }
}
