package Module_2_OOP.Lesson6.Zadanie2;

/**
 * Created by Roman on 30.11.2015.
 */
//Создать сотрудников: грузчик, кладовщик, водитель, менеджер, программист, руководитель отдела, директор.
// У каждого должны быть обязательные поля: имя, возраст, общий стаж работы, стаж работы в компании, должность.
// Разработать систему начисления заработной платы в зависимости от полей:
// возраст, общий стаж работы, стаж работы в компании, должность. Распечатать результат.

public class main_company {
    public static void main(String[] args) {

    }
}
